general/english/en_vocab_written.org
#+setupfile: ../../styles/readtheorg.setup
#+title: English Vocabulary: Written

* 名词

| attractiveness    | increase +     |
|-------------------+----------------|
| consequence       | severe +       |
|-------------------+----------------|
| drawback          | mitigate +     |
|-------------------+----------------|
| industrialisation |                |
|-------------------+----------------|
| infrastructure    | existing +     |
|-------------------+----------------|
| lack              | + of knowledge |
|-------------------+----------------|
| lifestyle         | adopt +        |
|                   | active +       |
|-------------------+----------------|
| open-mindedness   |                |
|-------------------+----------------|
| overcrowding      | experience +   |
|-------------------+----------------|
| urbanisation      |                |
|-------------------+----------------|
| vulnerability     | + to           |
|-------------------+----------------|
| well-being        | improve +      | 

* 名词短语

| global phenomenon    | + of     |
|----------------------+----------|
| less well off        |          |
|----------------------+----------|
| metropolitan centre  |          |
|----------------------+----------|
| quality of life      |          |
|----------------------+----------|
| self enforcing cycle |          |
|----------------------+----------|
| traffic congestion   |          |
|----------------------+----------|
| present day          | to the + |
|----------------------+----------|
| urban citizen        |          |

* 动词

| assimilate | fully + global events in the media               |
|------------+--------------------------------------------------|
| counter    | + violence                                       |
|------------+--------------------------------------------------|
| ease       | + traffic congestion                             |
|------------+--------------------------------------------------|
| foil       | + potential attack                               |
|------------+--------------------------------------------------|
| identify   | + location                                       |
|------------+--------------------------------------------------|
| mitigate   | + drawback                                       |
|------------+--------------------------------------------------|
| outline    | causes and solutions for this are outlined below |
|------------+--------------------------------------------------|
| overlook   |                                                  |

* 动词短语

| derive from |                 |
|-------------+-----------------|
| lead to     | + a decrease in |
|-------------+-----------------|
| learn about |                 |
|-------------+-----------------|
| yet to be   | + found         |

| be largely due to |                                          |
|-------------------+------------------------------------------|
| be trapped in     | + a positive self enforcing cycle        |
|-------------------+------------------------------------------|
| bring opportunity |                                          |
|-------------------+------------------------------------------|
| bring prosperity  |                                          |
|-------------------+------------------------------------------|
| bring to light    | + options you may not have known existed |

