general/english/en_vocab_written.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>English Vocabulary: Written</title>
<!-- 2016-05-27 周五 19:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<h1 class="title">English Vocabulary: Written</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 名词</a></li>
<li><a href="#sec-2">2. 名词短语</a></li>
<li><a href="#sec-3">3. 动词</a></li>
<li><a href="#sec-4">4. 动词短语</a></li>
<li><a href="#sec-5">5. 形容词</a></li>
<li><a href="#sec-6">6. 副词</a></li>
<li><a href="#sec-7">7. 副词短语</a></li>
<li><a href="#sec-8">8. 介词</a></li>
<li><a href="#sec-9">9. 介词短语</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 名词</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">attractiveness</th>
<th scope="col" class="left">increase +</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">consequence</td>
<td class="left">severe +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">drawback</td>
<td class="left">mitigate +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">industrialisation</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">infrastructure</td>
<td class="left">existing +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">lack</td>
<td class="left">+ of knowledge</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">lifestyle</td>
<td class="left">adopt +</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">active +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">open-mindedness</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">overcrowding</td>
<td class="left">experience +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">urbanisation</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">vulnerability</td>
<td class="left">+ to</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">well-being</td>
<td class="left">improve +</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 名词短语</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">global phenomenon</th>
<th scope="col" class="left">+ of</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">less well off</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">metropolitan centre</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">quality of life</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">self enforcing cycle</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">traffic congestion</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">present day</td>
<td class="left">to the +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">urban citizen</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 动词</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">assimilate</th>
<th scope="col" class="left">fully + global events in the media</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">counter</td>
<td class="left">+ violence</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">ease</td>
<td class="left">+ traffic congestion</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">foil</td>
<td class="left">+ potential attack</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">identify</td>
<td class="left">+ location</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">mitigate</td>
<td class="left">+ drawback</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">outline</td>
<td class="left">causes and solutions for this are outlined below</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">overlook</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 动词短语</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">derive from</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">lead to</td>
<td class="left">+ a decrease in</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">learn about</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">yet to be</td>
<td class="left">+ found</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">be largely due to</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">be trapped in</td>
<td class="left">+ a positive self enforcing cycle</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">bring opportunity</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">bring prosperity</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">bring to light</td>
<td class="left">+ options you may not have known existed</td>
</tr>
</tbody>
</table>
</div>
</div>
