general/english/en_vocab_written.org
* 形容词

| actual         | + fact, experience, work, challenge                                   |
|----------------+-----------------------------------------------------------------------|
| adequate       | + time, care, supply, support, resource, information                  |
|----------------+-----------------------------------------------------------------------|
| ample          | + evidence, opportunity, time, room, space, reason, resource          |
|----------------+-----------------------------------------------------------------------|
| artificial     | + object, situation                                                   |
|----------------+-----------------------------------------------------------------------|
| balanced       | + development, diet                                                   |
|----------------+-----------------------------------------------------------------------|
| beneficial     | + effect, impact, relationship, result                                |
|                | mutually, economically +                                              |
|----------------+-----------------------------------------------------------------------|
| benefited      | + group, party                                                        |
|----------------+-----------------------------------------------------------------------|
| biased         | + media, view, reporting, coverage                                    |
|                | racially, culturally, politically +                                   |
|----------------+-----------------------------------------------------------------------|
| civilized      | + man, society, country, behavior, manner                             |
|----------------+-----------------------------------------------------------------------|
| cost-effective |                                                                       |
|----------------+-----------------------------------------------------------------------|
| complementary  | + role, component, strategy                                           |
|----------------+-----------------------------------------------------------------------|
| compulsory     | + education                                                           |
|                | make sth. +                                                           |
|----------------+-----------------------------------------------------------------------|
| concrete       | + value, evidence, example, step, action                              |
|----------------+-----------------------------------------------------------------------|
| conservative   | + party, government, group, estimate, view                            |
|----------------+-----------------------------------------------------------------------|
| constant       | + change, state of change, modification, threat, pressure, source     |
|----------------+-----------------------------------------------------------------------|
| contentious    | + issue, relationship, debate, history                                |
|----------------+-----------------------------------------------------------------------|
| continuous     | + growth, improvement, process, learning, prosperity                  |
|----------------+-----------------------------------------------------------------------|
| controversial  | + issue, decision, figure, topic                                      |
|----------------+-----------------------------------------------------------------------|
| cooperative    | + effort, activity                                                    |
|----------------+-----------------------------------------------------------------------|
| critical       | + role, issue, factor, mistake                                        |
|                | increasingly +                                                        |
|----------------+-----------------------------------------------------------------------|
| dependable     | + source, information, quality                                        |
|----------------+-----------------------------------------------------------------------|
| destructive    | + power, behavior, effect, consequence                                |
|                | environmentally, ecologically +                                       |
|----------------+-----------------------------------------------------------------------|
| distinct       | + way, type, group, culture                                           |
|----------------+-----------------------------------------------------------------------|
| distorted      | + values, view, perception, history                                   |
|----------------+-----------------------------------------------------------------------|
| diverse        | + group, population, culture, background, need                        |
|                | culturally, ethnically +                                              |
|----------------+-----------------------------------------------------------------------|
| economical     | more + options                                                        |
|----------------+-----------------------------------------------------------------------|
| effective      | + way, strategy, method, solution                                     |
|----------------+-----------------------------------------------------------------------|
| essential      | + part, component, role, information, feature knowledge, skill        |
|----------------+-----------------------------------------------------------------------|
| established    | + custom                                                              |
|----------------+-----------------------------------------------------------------------|
| exotic         | + idea, custom, territory, species                                    |
|----------------+-----------------------------------------------------------------------|
| experienced    | + people, professional                                                |
|----------------+-----------------------------------------------------------------------|
| factual        | + knowledge, information, error, evidence                             |
|----------------+-----------------------------------------------------------------------|
| false          | + belief, information, claim, alarm                                   |
|----------------+-----------------------------------------------------------------------|
| feasible       | + option, alternative, solution, plan, strategy                       |
|----------------+-----------------------------------------------------------------------|
| flawed         | + system, policy                                                      |
|                | deeply, fundamentally, serious, inherently +                          |
|----------------+-----------------------------------------------------------------------|
| fruitful       | + research, study, effort                                             |
|----------------+-----------------------------------------------------------------------|
| futile         | + attempt, effort, talk, resistance                                   |
|----------------+-----------------------------------------------------------------------|
| gifted         | + child, learner; intellectually, academically +                      |
|                | [ talented ]                                                          |
|----------------+-----------------------------------------------------------------------|
| harmonious     | + society, relationship, environment                                  |
|----------------+-----------------------------------------------------------------------|
| hazardous      | + waste, material                                                     |
|                | potentially, extremely +                                              |
|----------------+-----------------------------------------------------------------------|
| identical      | almost, nearly +                                                      |
|----------------+-----------------------------------------------------------------------|
| idle           | + conversation, curiocity, thought                                    |
|----------------+-----------------------------------------------------------------------|
| ignorant       |                                                                       |
|----------------+-----------------------------------------------------------------------|
| imaginary      | + friend, character, object                                           |
|----------------+-----------------------------------------------------------------------|
| immoral        | + behavior, act, conduct                                              |
|----------------+-----------------------------------------------------------------------|
| impersonal     | + force, manner, relationship                                         |
|----------------+-----------------------------------------------------------------------|
| impracticable  | + plan, theory                                                        |
|----------------+-----------------------------------------------------------------------|
| indefinite     | + future, number, solution                                            |
|                | remain +                                                              |
|----------------+-----------------------------------------------------------------------|
| inept          | + management, policy, handling, leadership                            |
|                | socially, hopelessly +                                                |
|----------------+-----------------------------------------------------------------------|
| inevitable     | + result, outcome, consequence, change, conclusion                    |
|----------------+-----------------------------------------------------------------------|
| influential    | + leader, figure, factor, role                                        |
|                | [ powerful ]                                                          |
|----------------+-----------------------------------------------------------------------|
| informative    | + artical, book                                                       |
|                | [ educational ]                                                       |
|----------------+-----------------------------------------------------------------------|
| irreplaceable  | + part, resource, treasure, role, value, asset                        |
|                | [ unique, priceless, valuable ]                                       |
|----------------+-----------------------------------------------------------------------|
| instructive    | + example, case, experience, lesson                                   |
|----------------+-----------------------------------------------------------------------|
| integral       | + part, component, element                                            |
|----------------+-----------------------------------------------------------------------|
| interconnected | + world, network                                                      |
|                | globally +                                                            |
|----------------+-----------------------------------------------------------------------|
| interdependant | + relationship, society                                               |
|----------------+-----------------------------------------------------------------------|
| interrelated   | + factor, issue                                                       |
|                | closely +                                                             |
|----------------+-----------------------------------------------------------------------|
| misleading     | + infomation, advertising, statistics, impression                     |
|----------------+-----------------------------------------------------------------------|
| mounting       | + pressure, cost, tension, crisis                                     |
|----------------+-----------------------------------------------------------------------|
| newsworthy     | + event                                                               |
|----------------+-----------------------------------------------------------------------|
| objective      | + reality, truth, standard, information                               |
|----------------+-----------------------------------------------------------------------|
| occasional     | + use, problem, visit, trip                                           |
|----------------+-----------------------------------------------------------------------|
| perceived      | + option, threat, value                                               |
|----------------+-----------------------------------------------------------------------|
| perilous       | + situation, condition                                                |
|                | + to society                                                          |
|----------------+-----------------------------------------------------------------------|
| prominent      | + role, part, member                                                  |
|----------------+-----------------------------------------------------------------------|
| proper         | + way, use, behavior, knowledge, training                             |
|----------------+-----------------------------------------------------------------------|
| reasonable     | + conclusion, decision, doubt, suspicion, expectation, explaination   |
|----------------+-----------------------------------------------------------------------|
| reliable       | + information, method, way, result                                    |
|----------------+-----------------------------------------------------------------------|
| rising         | + need, demand, cost, pressure, wave, tide                            |
|----------------+-----------------------------------------------------------------------|
| seasoned       | + traveler, criminal, professional, veteran                           |
|----------------+-----------------------------------------------------------------------|
| subjective     | + experience, judgement, evaluation                                   |
|----------------+-----------------------------------------------------------------------|
| suitable       | + use, application, condition, environment                            |
|                | + for                                                                 |
|----------------+-----------------------------------------------------------------------|
| superior       | + quality, performance                                                |
|                | morally +                                                             |
|----------------+-----------------------------------------------------------------------|
| toxic          | + waste, material, release, byproduct                                 |
|----------------+-----------------------------------------------------------------------|
| trivial        | + detail, issue, event, difference, amount                            |
|                | relatively, seemingly, apparently +                                   |
|----------------+-----------------------------------------------------------------------|
| trustworthy    | + person, information, source                                         |
|----------------+-----------------------------------------------------------------------|
| twisted        | + mind, logic                                                         |
|----------------+-----------------------------------------------------------------------|
| two-faced      |                                                                       |
|----------------+-----------------------------------------------------------------------|
| unavoidable    | + fact, consequence, cost, risk, impact, loss, conflict               |
|----------------+-----------------------------------------------------------------------|
| undeniable     | + fact, truth, evidence, proof; it is + that                          |
|----------------+-----------------------------------------------------------------------|
| understandable | + reason, reaction, mistake                                           |
|                | perfectly, easily +                                                   |
|                | it is + that                                                          |
|----------------+-----------------------------------------------------------------------|
| unfair         | + competition, treatment                                              |
|----------------+-----------------------------------------------------------------------|
| uninterrupted  | + flow, growth                                                        |
|----------------+-----------------------------------------------------------------------|
| unrestricted   | + access, right, usage, growth                                        |
|----------------+-----------------------------------------------------------------------|
| unstoppable    | + force, determination                                                |
|----------------+-----------------------------------------------------------------------|
| various        | + way, method, solution, style, form, type, purpose, aspect, occasion |
|----------------+-----------------------------------------------------------------------|
| viable         | + alternative, option, solution                                       |
|----------------+-----------------------------------------------------------------------|
| vital          | + role, part, component, information, issue, importance               |

