general/english/en_vocab_written.html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 形容词</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">actual</th>
<th scope="col" class="left">+ fact, experience, work, challenge</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">adequate</td>
<td class="left">+ time, care, supply, support, resource, information</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">ample</td>
<td class="left">+ evidence, opportunity, time, room, space, reason, resource</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">artificial</td>
<td class="left">+ object, situation</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">balanced</td>
<td class="left">+ development, diet</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">beneficial</td>
<td class="left">+ effect, impact, relationship, result</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">mutually, economically +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">benefited</td>
<td class="left">+ group, party</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">biased</td>
<td class="left">+ media, view, reporting, coverage</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">racially, culturally, politically +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">civilized</td>
<td class="left">+ man, society, country, behavior, manner</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">cost-effective</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">complementary</td>
<td class="left">+ role, component, strategy</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">compulsory</td>
<td class="left">+ education</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">make sth. +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">concrete</td>
<td class="left">+ value, evidence, example, step, action</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">conservative</td>
<td class="left">+ party, government, group, estimate, view</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">constant</td>
<td class="left">+ change, state of change, modification, threat, pressure, source</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">contentious</td>
<td class="left">+ issue, relationship, debate, history</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">continuous</td>
<td class="left">+ growth, improvement, process, learning, prosperity</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">controversial</td>
<td class="left">+ issue, decision, figure, topic</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">cooperative</td>
<td class="left">+ effort, activity</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">critical</td>
<td class="left">+ role, issue, factor, mistake</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">increasingly +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">dependable</td>
<td class="left">+ source, information, quality</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">destructive</td>
<td class="left">+ power, behavior, effect, consequence</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">environmentally, ecologically +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">distinct</td>
<td class="left">+ way, type, group, culture</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">distorted</td>
<td class="left">+ values, view, perception, history</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">diverse</td>
<td class="left">+ group, population, culture, background, need</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">culturally, ethnically +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">economical</td>
<td class="left">more + options</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">effective</td>
<td class="left">+ way, strategy, method, solution</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">essential</td>
<td class="left">+ part, component, role, information, feature knowledge, skill</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">established</td>
<td class="left">+ custom</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">exotic</td>
<td class="left">+ idea, custom, territory, species</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">experienced</td>
<td class="left">+ people, professional</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">factual</td>
<td class="left">+ knowledge, information, error, evidence</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">false</td>
<td class="left">+ belief, information, claim, alarm</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">feasible</td>
<td class="left">+ option, alternative, solution, plan, strategy</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">flawed</td>
<td class="left">+ system, policy</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">deeply, fundamentally, serious, inherently +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">fruitful</td>
<td class="left">+ research, study, effort</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">futile</td>
<td class="left">+ attempt, effort, talk, resistance</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">gifted</td>
<td class="left">+ child, learner; intellectually, academically +</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">[ talented ]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">harmonious</td>
<td class="left">+ society, relationship, environment</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">hazardous</td>
<td class="left">+ waste, material</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">potentially, extremely +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">identical</td>
<td class="left">almost, nearly +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">idle</td>
<td class="left">+ conversation, curiocity, thought</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">ignorant</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">imaginary</td>
<td class="left">+ friend, character, object</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">immoral</td>
<td class="left">+ behavior, act, conduct</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">impersonal</td>
<td class="left">+ force, manner, relationship</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">impracticable</td>
<td class="left">+ plan, theory</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">indefinite</td>
<td class="left">+ future, number, solution</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">remain +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">inept</td>
<td class="left">+ management, policy, handling, leadership</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">socially, hopelessly +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">inevitable</td>
<td class="left">+ result, outcome, consequence, change, conclusion</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">influential</td>
<td class="left">+ leader, figure, factor, role</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">[ powerful ]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">informative</td>
<td class="left">+ artical, book</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">[ educational ]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">irreplaceable</td>
<td class="left">+ part, resource, treasure, role, value, asset</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">[ unique, priceless, valuable ]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">instructive</td>
<td class="left">+ example, case, experience, lesson</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">integral</td>
<td class="left">+ part, component, element</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">interconnected</td>
<td class="left">+ world, network</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">globally +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">interdependant</td>
<td class="left">+ relationship, society</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">interrelated</td>
<td class="left">+ factor, issue</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">closely +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">misleading</td>
<td class="left">+ infomation, advertising, statistics, impression</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">mounting</td>
<td class="left">+ pressure, cost, tension, crisis</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">newsworthy</td>
<td class="left">+ event</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">objective</td>
<td class="left">+ reality, truth, standard, information</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">occasional</td>
<td class="left">+ use, problem, visit, trip</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">perceived</td>
<td class="left">+ option, threat, value</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">perilous</td>
<td class="left">+ situation, condition</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">+ to society</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">prominent</td>
<td class="left">+ role, part, member</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">proper</td>
<td class="left">+ way, use, behavior, knowledge, training</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">reasonable</td>
<td class="left">+ conclusion, decision, doubt, suspicion, expectation, explaination</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">reliable</td>
<td class="left">+ information, method, way, result</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">rising</td>
<td class="left">+ need, demand, cost, pressure, wave, tide</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">seasoned</td>
<td class="left">+ traveler, criminal, professional, veteran</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">subjective</td>
<td class="left">+ experience, judgement, evaluation</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">suitable</td>
<td class="left">+ use, application, condition, environment</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">+ for</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">superior</td>
<td class="left">+ quality, performance</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">morally +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">toxic</td>
<td class="left">+ waste, material, release, byproduct</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">trivial</td>
<td class="left">+ detail, issue, event, difference, amount</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">relatively, seemingly, apparently +</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">trustworthy</td>
<td class="left">+ person, information, source</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">twisted</td>
<td class="left">+ mind, logic</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">two-faced</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">unavoidable</td>
<td class="left">+ fact, consequence, cost, risk, impact, loss, conflict</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">undeniable</td>
<td class="left">+ fact, truth, evidence, proof; it is + that</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">understandable</td>
<td class="left">+ reason, reaction, mistake</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">perfectly, easily +</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">it is + that</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">unfair</td>
<td class="left">+ competition, treatment</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">uninterrupted</td>
<td class="left">+ flow, growth</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">unrestricted</td>
<td class="left">+ access, right, usage, growth</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">unstoppable</td>
<td class="left">+ force, determination</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">various</td>
<td class="left">+ way, method, solution, style, form, type, purpose, aspect, occasion</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">viable</td>
<td class="left">+ alternative, option, solution</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">vital</td>
<td class="left">+ role, part, component, information, issue, importance</td>
</tr>
</tbody>
</table>
</div>
</div>
